#!/usr/bin/env perl

$do_cd = 1; # カレントディレクトリに移動

##-----------------------------------------------------------------------------
## latex options
##-----------------------------------------------------------------------------

$args = '  -c -shell-escape -file-line-error  -halt-on-error';
# -c … コンパイル時に生成されるファイルを削除
# -shell-escape … 任意の外部コマンドの実行(mintedのpygmentsなど)
# -halt-on-error … コンパイル中にエラーが発生した場合コンパイルを終了
# -file-line-error … TeXファイルの何行目でエラーが発生したかを表示

##-----------------------------------------------------------------------------
## latex
##-----------------------------------------------------------------------------

$latex  = 'uplatex  -kanji=utf8  -no-guess-input-enc'.$args;
$pdflatex = 'pdflatex'.$args;
$lualatex = 'lualatex'.$args;
$xelatex  = 'xelatex'.$args;

##-----------------------------------------------------------------------------
## pdf_mode
##-----------------------------------------------------------------------------

$pdf_mode = 4;
# $pdf_mode = 0; # latexでdviファイルを生成（PDFを出力しない）
# $pdf_mode = 1; # pdflatexを使う時（pdfを直接生成）
# $pdf_mode = 2; # latexで生成したdviをdvipsでpsに変換、ps2pdfによりPDFを作成
# $pdf_mode = 3; # uplatexを使う時（latexで生成したdviから、dvipdfmxによりPDFを作成）
# $pdf_mode = 4; # lualatexを使う時（pdfを直接生成）
# $pdf_mode = 5; # xelatexを使う時（xelatexで生成したdviから、xdvipdfmxによりPDFを作成）

##-----------------------------------------------------------------------------
## 出力/中間ファイルの扱い
##-----------------------------------------------------------------------------

$out_dir = ".";
$aux_dir = ".intermediates";

##-----------------------------------------------------------------------------
## BiB
##-----------------------------------------------------------------------------

$bibtex_use=2;
$bibtex    = 'upbibtex';# 'pbibtex';
$biber     = 'biber %O --bblencoding=utf8 -u -U --output_safechars %B';

##-----------------------------------------------------------------------------
## index
##-----------------------------------------------------------------------------

$makeindex = 'upmendex %O -o %D %S -s jpbase';

##-----------------------------------------------------------------------------
## dvi
##-----------------------------------------------------------------------------

$dvipdf = 'dvipdfmx %O -o %D %S';
$dvips  = 'dvips %O -z -f %S | convbkmk -u > %D';
$ps2pdf = 'ps2pdf.exe %O %S %D';
$max_repeat = 5;

##-----------------------------------------------------------------------------
# preview
##-----------------------------------------------------------------------------

# Mac OS用
$dvi_previewer = "open %S";
$pdf_previewer = "open %S";

##-----------------------------------------------------------------------------
